Revit 2027 API
RevitLinkType.IsLoaded Method
 Checks whether the link with this id is loaded.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsLoaded(
	Document document,
	ElementId typeId
)
Public Shared Function IsLoaded (
	document As Document,
	typeId As ElementId
) As Boolean
public:
static bool IsLoaded(
	Document^ document,
	ElementId^ typeId
)
static member IsLoaded :
        document : Document *
        typeId : ElementId -> bool
Parameters
document Document
 A document. Revit will see if typeId corresponds to a loaded link in this document.
typeId ElementId
 An element id. Revit will check if typeId corresponds to a loaded link in the given document.
Return Value
Boolean
 True if typeId corresponds to a loaded RevitLinkType. False otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 Returns false if typeId is not the id of a RevitLinkType.
See Also
Reference
RevitLinkType Class
Autodesk.Revit.DB Namespace